// ['0.1.1', '2.3.3', '0.3002.1', '4.2', '4.3.5', '4.3.4.5'] => ['4.3.5','4.3.4.5','2.3.3','0.3002.1','0.1.1']

let arr = ['0.1.1', '2.3.3', '0.3.2.1', '4.2', '4.2.3', '4.3.5', '4.3.4.5']
arr.sort((a, b) => {
  // 第一次比较a是'2.3.3'，b是'0.1.1'
  // 最后返回大于0，则两者不调换位置；返回小于0，则两者调换位置
  let t1 = a.split('.')
  let t2 = b.split('.')
  let i = 0
  while (1) {
    // 针对'4.2', '4.2.3'的情况
    if (t1[i] === undefined || t2[i] === undefined) {
      return t1.length - t2.length
    }

    if (t1[i] !== t2[i]) {
      return t1[i] - t2[i]
    }
    i++
  }
})
console.log(arr)
